// Общий модуль НормализацияСтрокПереопределяемый
// Флаги: Сервер.
//
// Настройка библиотеки под конфигурацию. При обновлении библиотеки модуль не заменяется.

#Область ПрограммныйИнтерфейс

// Определяет объекты, подключенные к нормализации строк.
// Каждый объект из списка должен вызывать НормализацияСтрок.ПередЗаписью и
// НормализацияСтрок.ОбработкаПроверкиЗаполнения из модуля объекта и описывать поля
// в процедуре ПриОпределенииНастроекНормализацииСтрок модуля менеджера.
// Объект, который вызывает обработчики библиотеки, но не указан здесь, при записи вызывает исключение.
//
// Параметры:
//  Объекты - Массив из ОбъектМетаданных - подключенные объекты.
//
// Пример:
//  Объекты.Добавить(Метаданные.Справочники.Номенклатура);
//  Объекты.Добавить(Метаданные.Документы.ЗаказКлиента);
//
Процедура ПриОпределенииПодключенныхОбъектов(Объекты) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
